package lesson20241010.arrays;

public class Tasks {

    // 1. Напишите метод, который меняет местами элементы одномерного массива из String в обратном порядке.
    //Не используйте дополнительный массив для хранения результатов.
    //Input:
    //	data = {"One", "Two", "Three"}
    //Result:
    //	data = {"Three", "Two", "One"}
    //


    // 2. Создать метод transpose(), который будет транспонировать матрицу (заменять строки на столбцы).
    //Input:
    //	1 2 3 4
    //	5 6 7 8
    //	9 0 0 0
    //Output:
    //	1 5 9
    //	2 6 0
    //	3 7 0
    //	4 8 0
    //


}
