package lesson20241119.streams;

public class Tasks {

    public static void main(String[] args) {
    // 1. Отсортировать с помощью стримов список из строк
    //- по алфавиту
    //- в обратном порядке

    //2. Из списка чисел типа Integer с помощью стримов создать список их строковых представлений

    //3. Создать список из экземпляров класса Employee.
    //public class Employee {
    //    private String name;
    //    private String surname;
    //    private int age;
    //    private int workingHoursInMonth;
    //}
    //
    //С помощью стримов:
    //- вывести список активных сотрудников старше 20 лет
    //- вывести список сотрудников, работающих более 30 часов, с именем, начинающимся на J
    //- вывести список фамилий сотрудников с именем John
    //- вывести список всех уникальных имен сотрудников
    }




}
